## Load Cleaned Dataset

In [1]:
import pandas as pd

df = pd.read_csv("../data/processed/cleaned_data.csv")
df.head()

,date,region,production_ton,operational_cost,sales_revenue,inventory_stock,profit
0,2024-01-01,Sulawesi,183,7977.0,17231,336,9254
1,2024-01-02,Sumatra,125,5602.0,7009,380,1407
2,2024-01-03,Sulawesi,103,6134.0,7260,458,1126
3,2024-01-04,Sulawesi,193,5522.0,13038,300,7516
4,2024-01-05,Sumatra,111,6268.0,16865,345,10597

## Buat dim_region

In [2]:
dim_region = df[["region"]].drop_duplicates().reset_index(drop=True)
dim_region["region_id"] = dim_region.index + 1
dim_region

       region  region_id
0    Sulawesi          1
1     Sumatra          2
2  Kalimantan          3

## Merge region_id ke fact

In [3]:
df = df.merge(dim_region, on="region")

## Buat dim_date

In [4]:
df["date"]= pd.to_datetime(df["date"])

dim_date = df[["date"]].drop_duplicates().reset_index(drop=True)
dim_date["date_id"] = dim_date.index + 1
dim_date["month"] = dim_date["date"].dt.month
dim_date["year"] = dim_date["date"].dt.year
dim_date

          date  date_id  month  year
0   2024-01-01        1      1  2024
1   2024-01-02        2      1  2024
2   2024-01-03        3      1  2024
3   2024-01-04        4      1  2024
4   2024-01-05        5      1  2024
..         ...      ...    ...   ...
360 2024-12-26      361     12  2024
361 2024-12-27      362     12  2024
362 2024-12-28      363     12  2024
363 2024-12-29      364     12  2024
364 2024-12-30      365     12  2024

[365 rows x 4 columns]

## Merge ke fact

In [6]:
df = df.merge(dim_date, on="date")

## Final fact table

In [7]:
fact_production = df[[\
    "region_id",
    "date_id",
    "production_ton",
    "sales_revenue",
    "operational_cost",
    "profit"
]]

fact_production.head()

   region_id  date_id  production_ton  sales_revenue  operational_cost  profit
0          1        1             183          17231            7977.0    9254
1          2        2             125           7009            5602.0    1407
2          1        3             103           7260            6134.0    1126
3          1        4             193          13038            5522.0    7516
4          2        5             111          16865            6268.0   10597

*Saya mengubah dataset flat menjadi star schema untuk meningkatkan efisiensi analytics dan mengurangi redundansi data. Fact table menyimpan metrik produksi, sementara dimension table menyimpan konteks waktu dan region.*